{	
	"main_title":"Algograph",
	"home_subtitle":"The machine that draws by coding",
	"button_init":"début",

	"intro_background":"codez",
	"intro_instructions":"This machine draws with the help of computer programs. <br><u>These programs consist of code that gives instructions for the machine to apply. </u><br>By modifying this code, the instructions change and the drawing changes",
	"intro_btn_tuto":"Tutorial",
	"intro_btn_easy":"Easy level",
	"intro_btn_hard":"Difficult level",

	"tuto1_title":"tuto",
	"tuto1_txt":"Before drawing with code, <br> <span>you have to learn a few basics.</span>",
	"tuto1_btn":"Let's begin!",

	"tuto2_title":"1. Create a simple shape",
	"tuto2_subtitle":"This is the code to create a square",
	"tuto2_explication":"To create another shape, <br>you have to change the variable SQUARE.",
	"tuto2_btn":"I understand",

	"tuto3_title":"1. Create a simple shape",
	"tuto3_instruction":"Touch the variable to change the shape",
	"tuto3_btn":"I understand",

	"tuto4_title":"2. Draw several shapes",
	"tuto4_instruction":"Add a triangle",
	"tuto4_explication":"The shapes are defined in relation to one another. <br>So to draw a circle and a triangle offset from each other, as one is 2 times smaller <br>than the other, x, y and size take values that define the x-axis,<br> the y-axis and the size of the triangle in relation to <br>the circle that is drawn first.",
	"tuto4_btn":"I understand",

	"tuto5_title":"3. Change the colours",
	"tuto5_instruction":"Tap the settings to change their value",
	"tuto5_btn":"I understand",

	"tuto6_title":"4. Rotate a shape",
	"tuto6_subtitle":"Use the \"rotate\" setting",
	"tuto6_btn":"I understand",

	"tuto7_title":"5. What is recursion?",
	"tuto7_subtitle":"In computing, recursion is a code that calls upon itself. ",
	"tuto7_explication":"In computing, recursion is a code that calls upon itself. <br>This trick allows you to draw complex shapes. <br>Here, we draw smaller and smaller squares that are <br>rotated in relation to the previous square.<br>To make them all visible, we make them transparent <br>with the variable \"a\".",
	"tuto7_btn":"I understand",

	"tuto8_title":"Go to practice",
	"tuto8_instruction":"Choose a difficulty level",
	"tuto8_btn_easy":"Easy level",
	"tuto8_btn_hard":"Difficult level",

	"credits_museo_title":"muséographie",
	"credits_museo_content":"Vincent Blech, commissaire de l'exposition <br>Stéphane Fay, contenus scientifiques",
	"credits_science_title":"Conseiller scientifique",
	"credits_science_content":"Laurent Viennot, Inria",
	"credits_prod_title":"Conception et réalisation",
	"credits_prod_content":"Conception, graphisme: Fleur de papier <br>Développement: Fleur de papier + Ben & Lou <br>Charte graphique: Villar + Vera <br>Traduction: Alpha",
	"credits_thanks_title":"Remerciements",
	"credits_thanks_content":"La communauté de Context Free Art <br> <br>Avec le soutien des donateurs de la campagne de financement participation",

	"easy_home_background":"easy",
	"easy_home_instructions":"Welcome to Easy level. <br>Choose a drawing to start coding.",
	"easy_exo_explication1_title":"This shape is made up of circle arcs (ARCTO) and lines (LINETO).",
	"easy_exo_explication1_content":"startshape: draws the \"heart\" shape<br>path: defines a new shape, here the \"heart\" shape<br>heart (filled): if filled = 0, the heart is empty, if filled = 1, the heart is full<br>MOVETO (xnum, ynum): move to a point xnum, ynum of the drawing<br>LINETO(xnum, ynum): draw a straight line from one point to another with (xnum, ynum)<br>ARCTO (xnum, ynum, radius): draw a circle arc from xnum, ynum with the radius radius<br>CLOSEPOLY (): closure of a curve from the last point to the first point.<br>STROKE: controls the thickness of the lines of the heart <br>saturation: colour saturation<br>brightness: colour brightness<br>hue: colour (on a wheel from 0 to 360)<br>if: condition saying that if the heart is full, then its colour is changed<br>FILL: to fill the heart with a colour if filled = 1",
	"easy_exo_explication2_title":"In this program, we define a circle (P), then a mosaic (F) consisting of P circles. <br>The mosaic F is then reproduced by the MF function that allows you to change its size or rotate it.<br> Finally, the MF function is called up by the START function which for example can change the colour of the drawing.",
	"easy_exo_explication2_content":"Background: background colour<br>startshape: draws the \"START\" shape<br>saturation: colour saturation<br>brightness: colour brightness<br>hue: colour (on a wheel from 0 to 360)<br>rotate: rotation<br>size: size<br>rule: defines a shape<br>CIRCLE: defines a circle<br>tile: defines a tile that covers the drawing",
	"easy_exo_explication3_title":"The triangoli function draws shapes, starting with triangles. It calls upon itself: this is called recursion. It allows you to draw smaller and smaller triangles to give the impression of blossoming. The triangoli function is called up by the triangolineri function that modifies the colours and tones of the whole drawing.",
	"easy_exo_explication3_content":"background: background colour<br>startshape: draws the \"triangolineri\" shape<br>rule: defines shapes<br>x: horizontal position<br>y: vertical position<br>brightness: colour brightness<br>hue: colour (on a wheel from 0 to 360)<br>rotate: rotation<br>size: size<br>TRIANGLE defines a triangle",
	"easy_exo_explication4_title":"The CORNERSQUARE function draws a square. The DOTS function draws small patterns in squares. The HALFLINE function draws a row of squares, with patterns, getting narrower and narrower. The LINE function draws two of these rows, with one positioned opposite the other. The HALFGRID function draws half of a drawing with rows of squares produced using LINE. The GRID function assembles two halves produced with HALFGRID.",
	"easy_exo_explication4_content":"rotate: rotation<br>size: size<br>loop: repetition of an instruction<br>flip: reflection with a certain angle in relation to a line",
	"easy_exo_close_btn":"close",
	"easy_exo_explication_btn":"Explanations",
	"easy_btn_other":"Try</br>another drawing",
	"easy_btn_finish":"I've finished my drawing.</br>Switch to Difficult level",

	"hard_btn_other":"Try <br>another drawing",
	"hard_btn_finish":"I've finished my drawing.</br>Switch to Expert level",
	"hard_home_background":"Difficult",
	"hard_home_instructions":"Bienvenue dans le mode difficile. <br>Pour commencer à coder, choisissez un motif qui vous servira de base",
	"hard_exo_explication5_title":"The star functions draw circles or series of circles getting smaller and smaller. Entering several star functions allows the program to randomly choose which one it wants to execute. The wings function draws wing shapes by repeating squares of varying sizes and orientations. The glow functions mix the shapes drawn with star and wing. The picture function adds colours.",
	"hard_exo_explication5_content":"alpha: opacity<br>rotate: rotation<br>size: size<br>hue: colour (on a wheel from 0 to 360)<br>saturation: colour saturation<br>brightness: colour brightness",
	"hard_exo_explication6_title":"CORNERSQUARE draws a square. FLIPPITY superimposes squares along a diagonal line, varying their brightness. DOODAA uses two FLIPPITY commands and assembles them to make the final square. DAY colours in the square.",
	"hard_exo_explication6_content":"hue: colour (on a wheel from 0 to 360)<br>saturation: colour saturation<br>brightness: colour brightness<br>flip: reflection with a certain angle in relation to a line<br>mod: remainder of the entire division (here of (floopity +1) / 4)",
	"hard_exo_explication7_title":"The tri function draws three sets of triangles and circles that are rotated and repeated, getting smaller and smaller.",
	"hard_exo_explication7_content":"hue: colour (on a wheel from 0 to 360)<br>saturation: colour saturation<br>brightness: colour brightness<br>alpha: opacity<br>rotate: rotation<br>size: size<br>CIRCLE: defines a circle<br>TRIANGLE: defines a triangle<br>SQUARE: defines a square",
	"hard_exo_close_btn":"close",
	"hard_exo_explication_btn":"Explanations",
	"hard_exo_documentation_btn":"documentation",
	"hard_exo_redraw_btn":"Start<br>again",
	"hard_exo_update_btn":"Mettre à jour<br>mon dessin",
	"hard_exo_instruction_code":"Touchez le code pour le modifier",

	"expert_background":"expert",
	"expert_instructions":"Bienvenue dans le mode expert. <br><br>À vous d'écrire le code, sans aide ni exemple !",
	"expert_btn_go":"c'est parti !",
	"expert_end_background":"bravo",
	"expert_exo_finish":"I've finished my drawing",
	"expert_end_instructions":"<span class=\"part1\">Well done!</span><br><br>You managed to draw by coding a computer program.<br><br><span class=\"part3\">Find this program in open source on<br>www.palais-decouverte.fr</span>",
	"expert_title":"Edit, delete or write your own code.<br><br>The drawing will be displayed in real time",
	
	"sources_title":"Sources",
	"sources_content":"Ce logiciel a été réalisé en open-source...",
	"sources_button":"Télécharger les sources",

	"menu-tuto":"Tutorial level",
	"menu-easy":"Easy level",
	"menu-hard":"Difficult level",
	"menu-expert":"Expert level",
	"menu-doc":"Documentation",
	"menu-sources":"Sources",
	"menu-credits":"Credits"
}