{	
	"main_title":"Algografo",
	"home_subtitle":"La macchina che disegna tramite codifica",
	"button_init":"Inizio",

	"intro_background":"codez",
	"intro_instructions":"Questa macchina esegue disegni utilizzando programmi informatici<br><u>costituiti da un codice e in grado di fornire istruzioni che vengono poi applicate dalla macchina.</u><br>Se questo codice viene modificato, anche le istruzioni cambiano di conseguenza, insieme al disegno.",
	"intro_btn_tuto":"tutorial",
	"intro_btn_easy":"Modalità facile",
	"intro_btn_hard":"Modalità difficile",

	"tuto1_title":"tuto",
	"tuto1_txt":"Prima di disegnare utilizzando un codice, <br> <span>è necessario imparare alcune nozioni di base.</span>",
	"tuto1_btn":"Si parte!",

	"tuto2_title":"1. Creare una forma semplice",
	"tuto2_subtitle":"Questo è il codice per creare un quadrato",
	"tuto2_explication":"Per creare un'altra forma, <br> è necessario modificare la variabile SQUARE.",
	"tuto2_btn":"Ho capito",

	"tuto3_title":"1. Creare una forma semplice",
	"tuto3_instruction":"Toccare la variabile per cambiare la forma",
	"tuto3_btn":"Ho capito",

	"tuto4_title":"2. Disegnare diverse forme",
	"tuto4_instruction":"Aggiungere un triangolo",
	"tuto4_explication":"Le forme vengono definite le une rispetto alle altre.<br>Di conseguenza, per disegnare un cerchio e un triangolo sfalsati l'uno<br> rispetto all'altro, con uno che è due volte più piccolo dell'altro, x, y e size acquisiscono i valoriche vanno a definire l'ascissa, l'ordinata e le dimensioni del triangolo<br in rapporto al cerchio, disegnato per primo.",
	"tuto4_btn":"Ho capito",

	"tuto5_title":"3. Cambiare i colori",
	"tuto5_instruction":"Toccare i parametri per modificarne il valore",
	"tuto5_btn":"Ho capito",

	"tuto6_title":"4. Ruotare una forma",
	"tuto6_subtitle":"Viene utilizzato il parametro « rotate ».",
	"tuto6_btn":"Ho capito",

	"tuto7_title":"5. Cos'è la ricorsione",
	"tuto7_subtitle":"In informatica, la ricorsione è un codice espresso nei termini di se stesso.",
	"tuto7_explication":"Nell'esempio seguente, nella funzione MiaForma, viene richiamata questa funzione. <br>Questo trucco consente di disegnare forme complesse. <br>Qui vengono disegnati dei quadrati sempre più piccoli, che ruotano su loro stessi rispetto al quadrato precedente.<br>Per fare in modo che siano tutti visibili, vengono resi trasparenti con la variabile « a ».",
	"tuto7_btn":"Ho capito",

	"tuto8_title":"Passa alla pratica",
	"tuto8_instruction":"Scegliere un livello di difficoltà",
	"tuto8_btn_easy":"Modalità facile",
	"tuto8_btn_hard":"Modalità difficile",

	"credits_museo_title":"muséographie",
	"credits_museo_content":"Vincent Blech, commissaire de l'exposition <br>Stéphane Fay, contenus scientifiques",
	"credits_science_title":"Conseiller scientifique",
	"credits_science_content":"Laurent Viennot, Inria",
	"credits_prod_title":"Conception et réalisation",
	"credits_prod_content":"Conception, graphisme: Fleur de papier <br>Développement: Fleur de papier + Ben & Lou <br>Charte graphique: Villar + Vera <br>Traduction: Alpha",
	"credits_thanks_title":"Remerciements",
	"credits_thanks_content":"La communauté de Context Free Art <br> <br>Avec le soutien des donateurs de la campagne de financement participation",

	"easy_home_background":"facile",
	"easy_home_instructions":"Benvenuto nella modalità facile.<br>Per iniziare a scrivere codice, scegliere un disegno.",
	"easy_exo_explication1_title":"Questa forma è costituita da semicerchi (ARCTO) e linee (LINETO)",
	"easy_exo_explication1_content":"startshape: disegna una forma a cuore<br>path: definisce una nuova forma, in questo caso a cuore<br>coeur(filled): se filled = 0, il cuore è vuoto, se filled = 1, il cuore è pieno<br>MOVETO(xnum, ynum ): posizionarsi in un punto xnum, ynum del disegno<br>LINETO(xnum, ynum ): tracciare una retta da un punto a un altro in (xnum, ynum )<br>ARCTO(xnum, ynum, rayon): tracciato un semicerchio da xnum, ynum con un raggio rayon<br>CLOSEPOLY():chiusura di una curva partendo dall'ultimo punto al punto iniziale.<br>STROKE: controlla lo spessore delle linee del cuore<br>saturation: saturazione del colore<br>brightness: luminosità del colore<br>hue:colore (su una palette da 0 a 360)<br>if: condizione che stabilisce che se il cuore è pieno, allora il colore viene modificato<br>FILL:  per riempire il cuore di un colore se filled = 1",
	"easy_exo_explication2_title":"Questo programma definisce un cerchio (P), seguito da un mosaico (F) costituito da cerchi P.<br>Il mosaico F viene quindi realizzato tramite la funzione MF che consente di modificarne le dimensioni o di ruotarlo.<br>Infine, la funzione MF viene richiamata dalla funzione START che va, ad esempio, a modificare il colore del disegno.",
	"easy_exo_explication2_content":"Background: colore dello sfondo<br>startshape: disegna la forma \"START\"<br>saturation: saturazione del colore<br>brightness: luminosità del colore<br>hue: colore (su una palette da 0 a 360)<br>rotate: rotazione<br>size: dimensioni<br>rule : consente di definire una forma<br>CIRCLE: definisce un cerchio<br>tile: definisce una tessera che ricopre il disegno",
	"easy_exo_explication3_title":"La funzione triangoli disegna le forme, inizialmente triangolari. Si esprime nei termini di se stessa ed è ciò che viene definito ricorsione. Ciò consente di disegnare triangoli sempre più piccoli, per ricreare un effetto simile alla fioritura. La funzione triangoli viene richiamata dalla funzione triangolineri,che modifica i colori e i toni dell'insieme.",
	"easy_exo_explication3_content":"background: colore dello sfondo<br>startshape: designa la forma \"triangolineri\"<br>rule: definisce le forme<br>x: posizione orizzontale<br>y: posizione verticale<br>brightness: luminosità del colore<br>hue: colore (su una palette da 0 a 360)<br>rotate: rotazione<br>size : dimensioni<br>TRIANGLE definisce un triangolo",
	"easy_exo_explication4_title":"La funzione CORNERSQUARE disegna un quadrato. La funzione DOTS disegna piccoli motivi all'interno dei quadrati. La funzione HALFLINE disegna una fila di quadrati, con i loro motivi decorativi, sempre più stretti. La funzione LINE disegna due file, una in posizione opposta rispetto all'altra. La funzione HALFGRID realizza una metà del disegno con le file di quadrati ottenuti con LINE. La funzione GRID unisce le due metà ottenute con HALFGRID.",
	"easy_exo_explication4_content":"rotate: rotazione<br>size : dimensioni<br>loop: ripetizione di un'istruzione<br>flip: capovolgimento con una determinata angolazione rispetto a una linea",
	"easy_exo_close_btn":"chiudere",
	"easy_exo_explication_btn":"Spiegazioni",
	"easy_btn_other":"Provare con un</br> altro disegno",
	"easy_btn_finish":"Ho finito il mio disegno.</br>Passa alla modalità difficile",

	"hard_btn_other":"Provare con un</br> altro disegno",
	"hard_btn_finish":"Ho finito il mio disegno.</br>Passa alla modalità esperto",
	"hard_home_background":"Difficile",
	"hard_home_instructions":"Benvenuto nella modalità difficile. <br>Per iniziare a scrivere codice, scegliere un disegno. ",
	"hard_exo_explication5_title":"Le funzioni star disegnano dei cerchi o delle serie di cerchi sempre più piccoli.</br> Aggiungere più funzioni star consente al programma di scegliere in modo casuale quale eseguire.</br> La funzione wings disegna delle specie di ali ripetendo dei quadrati di dimensioni e orientamento diversi.</br> Le funzioni glow mischiano le forme disegnate con star e wing. La funzione picture aggiunge i colori.",
	"hard_exo_explication5_content":"alpha: opacità<br>rotate: rotazione<br>size : dimensioni<br>hue: colore (su una palette da 0 a 360)<br>saturation: saturazione del colore<br>brightness: luminosità del colore",
	"hard_exo_explication6_title":"CORNERSQUARE disegna un quadrato.<br> FLIPPITY sovrappone dei quadrati lungo una diagonale, variandone la luminosità.<br> DOODAA utilizza due FLIPPITY e li unisce per creare il quadrato finale.<br> DAY colora il quadrato.",
	"hard_exo_explication6_content":"hue: colore (su una palette da 0 a 360)<br>saturation: saturazione del colore<br>brightness: luminosità del colore<br>flip:capovolgimento con una determinata angolazione rispetto a una linea<br>mod: resto della divisione intera (in questo caso corrisponde a (floopity+1)/4)",
	"hard_exo_explication7_title":"La funzione tri disegna tre insiemi di triangoli e cerchi che vengono ruotati e ripetuti con dimensioni sempre più piccole. ",
	"hard_exo_explication7_content":"hue:colore (su una palette da 0 a 360)<br>saturation: saturazione del colore<br>brightness: luminosità del colore<br>alpha: opacità<br>rotate: rotazione<br>size : dimensioni<br>CIRCLE: definisce un cerchio<br>TRIANGLE: definisce un triangolo<br>SQUARE: definisce un quadrato",
	"hard_exo_close_btn":"chiudere",
	"hard_exo_explication_btn":"Spiegazioni",
	"hard_exo_documentation_btn":"documentation",
	"hard_exo_redraw_btn":"Recommencer<br>mon dessin",
	"hard_exo_update_btn":"Mettre à jour<br>mon dessin",
	"hard_exo_instruction_code":"Touchez le code pour le modifier",

	"expert_background":"esperto",
	"expert_instructions":"Benvenuto nella modalità esperto.<br>À vous d'écrire le code, sans aide ni exemple !",
	"expert_btn_go":"Si parte!",
	"expert_title":"Modificare, eliminare o scrivere un codice.",
	"expert_exo_finish":"Ho finito il mio disegno",
	"expert_end_background":"Bravo",
	"expert_end_instructions":"<span class=\"part1\">COMPLIMENTI !</span><br><br>Avete terminato il disegno tramite codifica di un programma informatico. <br><br><span class=\"part3\">Potrete ritrovare questo programma in open source su <br>www.palais-decouverte.fr</span>",

	"sources_title":"Sources",
	"sources_content":"Ce logiciel a été réalisé en open-source...",
	"sources_button":"Télécharger les sources",

	"menu-tuto":"Tutorial",
	"menu-easy":"Modalità facile",
	"menu-hard":"Modalità difficile",
	"menu-expert":"Modalità esperto",
	"menu-doc":"Documentation",
	"menu-sources":"Sources",
	"menu-credits":"Crédits"
}